help/VanDerPol.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title><b>VanDerPol</b> - van der Pol Oscillator</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-05-10 17:17:10 CEST"/>
<meta name="author" content="Oswald Berthold"/>
</head><body>
<h1 class="title"><b>VanDerPol</b> - van der Pol Oscillator</h1>

<p>see also: WeaklyNonlinear(2), from SLUGens/sc3-plugins
</p>
<p>
\#x,y = VanDerPol.ar(drv, freq, e, a, h, xi, yi, mul, add)
</p>
<ul>
<li>
<b>drv</b>: driving signal (input)
</li>
<li>
<b>freq</b>: iteration frequency in hertz
</li>
<li>
<b>e</b>: damping parameter
</li>
<li>
<b>a</b>: coupling parameter for input
</li>
<li>
<b>xi</b>: initial x value (x0)
</li>
<li>
<b>yi</b>: initial y value (y0)
</li>
<li>
<b>mul</b>: as usual
</li>
<li>
<b>add</b>: s.a.

</li>
</ul>

<p>Implements the van der Pol equation (see
e.g. <a href="http://en.wikipedia.org/wiki/Van_der_Pol_oscillator">http://en.wikipedia.org/wiki/Van_der_Pol_oscillator</a>),
via L. Putnam's runge-kutta solver, 
</p>



<pre class="example">
VanDerPol.equation
</pre>





<pre class="example">
// basic test
{VanDerPol.ar(drv: SinOsc.ar(1), freq: 22050, e: 0.1, a: 0, h: 0.05, xi: 0.1, yi: 0)}.play

(// explore params with mouse
{Out.ar(0, Pan2.ar(
        VanDerPol.ar(drv: SinOsc.ar(1.0), freq: 44100, e: MouseX.kr(0, 5.0), a: MouseY.kr(0, 2.5), h: 0.05, xi: 0.1, yi: 0, mul: 0.1);
))}.play
)
</pre>





<pre class="example">
// set params
(
SynthDef(\vdp, {|freq(22050), mfreq(1), e(0.1), a(0.0), amp(0.1)|
        var vdp = VanDerPol.ar(drv: SinOsc.ar(mfreq), freq: freq, e: e, a: a, h: 0.05, xi: 0.1, yi: 0, mul: amp);
        Out.ar(0, vdp);
}).store;
)

(// explore parameter space
var pat, num;
num = 50;
pat = Pmono(\vdp,
        \freq, s.sampleRate,
        \mfreq, Pseq(
                [Pseq([1.0], num),
                        Pseries(1.0, 0.1, num)], 1),
        \e, Pseq([Pseries(0.1, 0.1, num)], 2),
        \a, Pseq([Pseq([0.0], num), Pseries(0.0, 0.1, num+1)], 2),
        \amp, 0.1,
        //\amp, 1.0,
        \dur, Pseq([1/3], 3*num)
);
pat.play;
)
</pre>



<div id="postamble"><p class="author"> Author: Oswald Berthold
<a href="mailto:opt@xdv.org">&lt;opt@xdv.org&gt;</a>
</p>
<p class="date"> Date: 2009-05-10 17:17:10 CEST</p>
<p>HTML generated by org-mode 6.21b in emacs 22</p>
</div></body>
</html>
